export const MAX_POSTS_ON_PAGE = 8
export const MAX_POSTS_LOAD = 16

export const descriptionList = [
  {
    id: 0,
    title: 'Три режима скорости',
    text: `Три режима езды позволяют почуствовать себя комфортно в любой ситуации. Режим «S»
    увеличитвает скорость, если опаздываете на работу. Во время прогулки по парку
    активируйте режим «D». Включите режим «Пешеход», когда двигаетесь по оживлённой улице.`,
  },
  {
    id: 1,
    title: 'Система восстановления энергии',
    text: `Во время торможения и движения по инерции система преобразовывает кинетическую энергию в
      электрическую, позволяя увеличить общий запас хода самоката.`,
  },
  {
    id: 2,
    title: 'Мощная батарея',
    text: ` Самокат оснащен аккумулятором емкостью 12 800 мАч. Это позволяет преодолевать расстояния
      до 45 км без подзарядки.`,
  },
]


export const securityList = [
  {
    id: 0,
    title: 'Яркие ходовые огни',
    text: `Продуманный угол рассеивания света позволяет сохранять хорошую видимость, не ослепляя других участников движения.`,
  },
  {
    id: 1,
    title: 'Система восстановления энергии',
    text: `При нажатии наручку тормоза системы переднего и заднего колеса активируются последовательно, сокращая тормозной путь и обеспечивая безопасную и плавную остановку.`,
  },
  {
    id: 2,
    title: 'Яркая задняя фара',
    text: `При включении ходовых огней задняя фара включается автоматически. При нажатии на ручку тормоза она начинает мигать, предупреждая других участников движения.`,
  },
  {
    id: 3,
    title: 'Отражатели спереди, сбоку и сзади',
    text: `Улучшенные отражатели, размещенные с четырех сторон, делают вашу поездку в темное время суток безопаснее.`,
  }
  
]
